#資料:程式的基本單位

#整數
from re import A


3456

3.5 #浮點數

#字串
"測試中文"
"Hello World"

#布林值
True
False

#有順序、可動的列表 List，可疊代的資料
[3,4,5]
["Hello World","Haha"]

#有順序、不可動的列表 Tuple，可疊代的資料
(3,4,5)
("Hello","World")

#集合 Set 沒有順序的概念，可疊代的資料
{3,4,5}
{"Hello","World"}

#字典 Dictionary
{"apple":"蘋果","banana":"香蕉"}

#變數:用來儲存資料的自訂名稱
# 變數名稱 = 資料


#可疊代的資料用於for迴圈
'''
for 變數名稱 in 可疊代的資料:
    將可疊代的資料分開
    逐一取出
'''
for x in {"a","test",10,4,11}: #集合是可疊代的資料，且無順序性，會隨機印出來
    print(x)

for i in (3,4,6):
    print(i)

for t in {"a":3,"b":4}:
    print(t)             #只取的出Key值，但印不出value

dic = {"a":3,"b":4}
for s in dic:
    print(s)
    print(dic[s]) #這樣才能把Value拿出來


#內建函式
data = [111,8,10,2,3,4,6]
print(max(data)) #找出最大值
print(sorted(data)) #排序用的，小到大
print(data)

"-------------------------------------------------------------------"
#在Python裡面，不必特別定義資料型別，屬於動態語言的特色。

#程序碼風格 : PEP8
#透過縮排來規範同個層級。

#python支援二進制、八進制、十進制、十六進制：

#二進制前綴：0b or 0B
a = 0b1010
print (a) #顯示十

#八進制前綴：0o or 0O
a = 0o12
print (a) #顯示十

#十六進制前綴：0x or 0X
a = 0o12
print (a) #顯示十

"-------------------------------------------------------------------"

#浮點數
a = 1.2
#計算時有可能會丟失精度，如1/3 = 0.333333....。


#如果需要知道變數的種類，type(x)，即可。


"-------------------------------------------------------------------"
#字符串

a = 'test'
a = "test"
#可以用三引號內使用各一個單引號與雙引號
a = '''cool"ha'hh'ha"'''

a = "abcd\nefgh" #\n是換行
print(a)

a = "我愛\"妳\"" #\是跳脫字元

a[0] #稱為索引，索引從0開始。

len(a) #顯示a字串長度。

#字串的格式化：
name = "python"
age = 27

#想印出 "我是python, 今年27歲"

str = "我是" + name + ", " + "今年" + str(age) + "歲" #第一種方式，土炮。
print(str)

str = "我是{name}, 今年{age}歲".format(
    name = 'aaa', age = '29'
) #字串格式化的一種
print (str)

str = f"我是{name}, 今年{age}歲" #加上f來引用外部變數，最推薦的方式，但假如有很多，可以用上述的format。
print(str)

'--------------------------------------------------------------------------------------------'
#test = input()
#ans = test.replace(" ","") #移除字串中的空白用replace來做
#print(ans)
'--------------------------------------------------------------------------------------------'

#布爾型 = 布林值
a = True
b = False
print(type(a))
